Catalogs/бит_Счетчики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_Счетчики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСчетчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ВидыСчетчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОпломбированияЗаводом</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСнятия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДистанционноеСнятиеПоказаний</Name>
					<Comment>Наличие возможности дистанционного снятия показаний</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаводскойСерийныйНомерПУ</Name>
					<Comment>Заводской (серийный) номер прибора учета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформацияДатчиковДавления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформацияДатчиковТемпературы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонечныеПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентТрансформации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентУмножения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркаПУ</Name>
					<Comment>Марка прибора учета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МежповерочныйИнтервал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_МежповерочныйИнтервал</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельПУ</Name>
					<Comment>Модель прибора учета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованияУстановленнойСистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеДатчиковДавления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеДатчиковТемпературы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериодаПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныеПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрядность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчетчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипСчетчика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйНомерГИСЖКХ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

AccumulationRegisters/бит_ПоказанияСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_ПоказанияСчетчиков</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоследниеПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущиеПоказанияИнспектора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущиеПоказанияНаселения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказанияПодкрутка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/бит_ПоверкаСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПоверкаСчетчиков</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СнятНаПоверку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_СчетчикиНаУслугахОбщий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СчетчикиНаУслугахОбщий</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСчетчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипСчетчика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРаспределения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Многотарифный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоУстановкиСчетчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Комнаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Comment>Приоритет общедомового счетчика</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьСтавкуПоСчетчику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетчикСЗависимымиУслугами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнаяУслуга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПравилоУменьшения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаУменьшения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРаспределенияУменьшения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРаспределения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_ТипСчетчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ТипСчетчика</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Групповой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Индивидуальный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/бит_Счетчики/Forms/ФормаЭлементаУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура осуществляет управление доступностью/видимостью элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере 
Процедура УправлениеЭлементамиФормы()
	
	Элементы.ТипСчетчика.Доступность          = мКэшЗначений.ЭлементыДоступныКИзменению;
	Элементы.ВидСчетчика.Доступность          = мКэшЗначений.ЭлементыДоступныКИзменению;
	Элементы.Разрядность.Доступность          = мКэшЗначений.ЭлементыДоступныКИзменению;
	Элементы.КоэффициентУмножения.Доступность = мКэшЗначений.ЭлементыДоступныКИзменению;
	
КонецПроцедуры // УправлениеЭлементамиФормы()

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта"      , Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	КэшированныеЗначения.Вставить("ЭлементыДоступныКИзменению", Истина);
	КэшированныеЗначения.Вставить("ЭтоНовый"                  , НЕ ЗначениеЗаполнено(Параметры.Ключ));
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

&НаСервере
Процедура ЗаполнитьОписание()
	
	Результат.Очистить();
	
	мКэшЗначений.ЭлементыДоступныКИзменению = Истина;
	
	Макет = Справочники.бит_Счетчики.ПолучитьМакет("ИнформацияОСчетчике");
	
	ОбластьШапка        = Макет.ПолучитьОбласть("Шапка");
	ОбластьУслугиШапка  = Макет.ПолучитьОбласть("УслугиШапка");
	ОбластьУслугиСтрока = Макет.ПолучитьОбласть("УслугиСтрока");
	ОбластьЛСШапка      = Макет.ПолучитьОбласть("ЛСШапка");
	ОбластьЛССтрока     = Макет.ПолучитьОбласть("ЛССтрока");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Счетчик", Параметры.Ключ);
	Запрос.УстановитьПараметр("Дата"   ,КонецДня(ТекущаяДата()));
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ПоказанияСчетчиковОстатки.Объект,
	|	бит_ПоказанияСчетчиковОстатки.Услуга,
	|	бит_ПоказанияСчетчиковОстатки.Счетчик,
	|	бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток КАК НачальныеПоказания,
	|	ВЫБОР
	|		КОГДА (НЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток = 0)
	|			ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток
	|		ИНАЧЕ ВЫБОР
	|				КОГДА (НЕ бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток = 0)
	|					ТОГДА бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток
	|				ИНАЧЕ ВЫБОР
	|						КОГДА (НЕ бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток = 0)
	|							ТОГДА бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК КонечныеПоказания
	|ПОМЕСТИТЬ Показания
	|ИЗ
	|	РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(&Дата, Счетчик = &Счетчик) КАК бит_ПоказанияСчетчиковОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ПоверкаСчетчиковСрезПоследних.Счетчик,
	|	бит_ПоверкаСчетчиковСрезПоследних.ДатаПоверки
	|ПОМЕСТИТЬ ПоверкаСчетчика
	|ИЗ
	|	РегистрСведений.бит_ПоверкаСчетчиков.СрезПоследних(&Дата, Счетчик = &Счетчик) КАК бит_ПоверкаСчетчиковСрезПоследних
	|ГДЕ
	|	(НЕ бит_ПоверкаСчетчиковСрезПоследних.СнятНаПоверку)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект КАК Объект,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать КАК Использовать,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Период КАК Период,
	|	ЕСТЬNULL(Показания.НачальныеПоказания, 0) КАК НачальныеПоказания,
	|	ЕСТЬNULL(Показания.КонечныеПоказания, 0) КАК КонечныеПоказания,
	|	ПоверкаСчетчика.ДатаПоверки КАК ДатаПоверки
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(&Дата, Счетчик = &Счетчик) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Показания КАК Показания
	|		ПО бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект = Показания.Объект
	|			И бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга = Показания.Услуга
	|			И бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик = Показания.Счетчик
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПоверкаСчетчика КАК ПоверкаСчетчика
	|		ПО бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик = ПоверкаСчетчика.Счетчик
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ
	|ИТОГИ
	|	МАКСИМУМ(Использовать),
	|	МАКСИМУМ(ДатаПоверки)
	|ПО
	|	Период,
	|	Объект";
	
	ВыборкаПериод = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СтатусСчетчика = "Счетчик не установлен.";
	ДатаПоверки = "";
	ОбъектУчета = "";
	
	ТаблицаУслуг = Новый ТабличныйДокумент;
	
	ЕстьУслуги = Ложь;
	
	Если ВыборкаПериод.Следующий() Тогда
		
		ВыборкаОбъект = ВыборкаПериод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		СтатусСчетчика = "Счетчик " + ?(ВыборкаПериод.Использовать, "установлен ","снят ") +" от: " + Формат(ВыборкаПериод.Период,"ДФ=dd.MM.yyyy" );
		ДатаПоверки     = Формат(ВыборкаПериод.ДатаПоверки,"ДФ=dd.MM.yyyy" );
		
		Объект.ДатаПоверки       = ВыборкаПериод.ДатаПоверки;
		
		мКэшЗначений.ЭлементыДоступныКИзменению = НЕ ВыборкаПериод.Использовать;
		
		Пока ВыборкаОбъект.Следующий() Цикл
			
			Выборка = ВыборкаОбъект.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				ЕстьУслуги = Истина;
				
				ОбластьУслугиСтрока.Параметры.Заполнить(Выборка);
				ТаблицаУслуг.Вывести(ОбластьУслугиСтрока);
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ОбластьШапка.Параметры.СтатусСчетчика = СтатусСчетчика;
	ОбластьШапка.Параметры.ДатаПоверки    = ДатаПоверки;
	
	Результат.Вывести(ОбластьШапка);
	
	Если ЕстьУслуги Тогда
		
		Результат.Вывести(ОбластьУслугиШапка);
		Результат.Вывести(ТаблицаУслуг);
		
	КонецЕсли; 
	
	Если Объект.ТипСчетчика = Перечисления.бит_ТипСчетчика.Групповой Тогда
		
		ТаблицаЛС = Новый ТабличныйДокумент;
		ВывеслиЛС = Ложь;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ГрупповыеСчетчикиСрезПоследних.ГрупповойСчетчик,
		|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет,
		|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет.Наименование КАК Наименование,
		|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет.Здание КАК Здание,
		|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет.УлицаЛицевогоСчета КАК Улица
		|ИЗ
		|	РегистрСведений.бит_ГрупповыеСчетчики.СрезПоследних(&Дата, ГрупповойСчетчик = &Счетчик) КАК бит_ГрупповыеСчетчикиСрезПоследних
		|ГДЕ
		|	бит_ГрупповыеСчетчикиСрезПоследних.Использовать
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_ГрупповыеСчетчикиСрезПоследних.ГрупповойСчетчик,
		|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет,
		|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет.Наименование,
		|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет.Здание,
		|	бит_ГрупповыеСчетчикиСрезПоследних.ЛицевойСчет.УлицаЛицевогоСчета
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ВывеслиЛС = Истина;
			
			ОбластьЛССтрока.Параметры.ЛицевойСчет = Выборка.ЛицевойСчет;
			ОбластьЛССтрока.Параметры.Владелец    = "ул. " + Выборка.Улица + ", д. " + Выборка.Здание;
			ТаблицаЛС.Вывести(ОбластьЛССтрока);
			
		КонецЦикла; 
		
		Если ВывеслиЛС Тогда
			
			Результат.Вывести(ОбластьЛСШапка);
			Результат.Вывести(ТаблицаЛС);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФорму()
	
	ЗаполнитьОписание();
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	ЗаполнитьОписание();
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если мКэшЗначений.ЭтоНовый Тогда
		
		Объект.КоэффициентУмножения = 1;
		
	КонецЕсли;                     
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьФорму();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьФорму();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура РазрядностьОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ПравильныйКод = КодСимвола("9");
	
	СтрокаМаксЗначения = бит_ОбщегоНазначения.УбитьЛишнее(Текст);
	
	Длина = СтрДлина(СтрокаМаксЗначения);
	Для Значение=1 По Длина Цикл
		КодЦифры = КодСимвола(СтрокаМаксЗначения,Значение);
		Если НЕ КодЦифры = ПравильныйКод Тогда
			// БИТ_ЖКХ_020813_начало_изменений
			//Элемент.Значение = 0;
			Объект.Разрядность = 0;
			СтандартнаяОбработка = Ложь;
			// БИТ_ЖКХ_020813_окончание_изменений

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Введены некорректные данные. ""Максимальное значение"" может содержать только цифру ""9""!");
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
